{
  "id": "Commemorating-Menstrual-Hygiene-Management-Day-2024",
  "title": "Commemorating Menstrual Hygiene Management Day: Reaching Over 500 Girls Across Malawi",
  "date": "2024-05-11",
  "image": "/blog-images/post3.jpg",
  "tags": ["MHM2024", "PeriodFriendlyWorld", "Health"],
  "excerpt": "In honour of Menstrual Hygiene Management Day, our team embarked on a meaningful outreach journey...",
  "content": "<p>In honour of Menstrual Hygiene Management Day, our team embarked on a meaningful outreach journey across Malawi, visiting Chirimba CDSS in Blantyre, Biwi CDSS in Lilongwe, and Zolozolo CDSS in Mzuzu. Over the course of our visits, we reached more than 500 girls, engaging them in open and honest conversations about menstrual hygiene and period positivity. The sessions were designed to be interactive, allowing girls to ask questions and share their experiences in a safe and supportive environment. We focused on the importance of menstrual hygiene, highlighting how proper care can impact health, confidence, and school attendance. We also took time to debunk common myths and misconceptions surrounding menstruation—because accurate information is key to changing harmful beliefs and practices. What stood out most during our visits was the energy and openness of the girls. Many shared stories of challenges they face during their menstrual cycle, including lack of access to sanitary products and limited knowledge about menstrual health. These conversations reinforced why our work matters and why support for menstrual hygiene must continue. To further support the girls’ menstrual health, we donated sanitary pads to each school. Access to menstrual products is essential for girls to stay in school and maintain their dignity, especially during their menstrual cycle. While the donation may seem small, it has a powerful impact on the lives of the girls we reached, helping to reduce absenteeism and boost confidence. Our visit during Menstrual Hygiene Management Day was more than an outreach—it was a reminder of the importance of breaking stigma and creating supportive spaces for girls to learn, grow, and thrive. We are grateful for the opportunity to connect with these communities and remain committed to ensuring that every girl has the resources and knowledge she needs to manage her menstrual health with dignity.</p>"
}