{
  "id": "ICT-Skills-Training-Graduation",
  "title": "ICT Skills Training Graduation: Preparing Girls For The Digital Future",
  "date": "2025-03-31",
  "image": "/blog-images/post2.jpg",
  "tags": ["ict", "education"],
  "excerpt": "We have officially wrapped up our ICT Skills Training, marking the end of an inspiring and transformative journey...",
  "content": "<p>We have officially wrapped up our ICT Skills Training, marking the end of an inspiring and transformative journey. Over the course of the programme, the girls demonstrated commitment, curiosity, and a strong willingness to learn as they built practical digital skills essential for today’s world.Throughout the sessions, participants were introduced to key tools such as Microsoft Word, Excel, and online collaboration platforms. These skills are more than just technical abilities—they are gateways to confidence, independence, and greater opportunities in education and the workplace. Watching the girls grow more comfortable and capable in navigating the digital space was a powerful reminder of why this work matters.The programme concluded on a high note with an examination session that celebrated both effort and excellence. Best-performing students were recognised for their outstanding achievements, and certificates were awarded to all participants in recognition of their dedication and progress. The excitement, pride, and sense of accomplishment in the room spoke volumes about how far the girls had come.We are incredibly proud of every participant for showing up, pushing through challenges, and embracing new skills. Our heartfelt appreciation goes to the volunteers, facilitators, and supporters whose time, expertise, and encouragement made this programme possible.This milestone is not an end but a beginning. With these newly acquired skills and confidence, the girls are better prepared to engage with the digital world and pursue future opportunities. The digital future is theirs to claim, and they are ready.</p>"
}